print('车次\t出发站-到达站\t出发时间\t到达时间\t历时')
print('T40\t长春-北京\t00:12\t\t12:20\t\t12：:18')
print('T298\t长春-北京\t00:06\t\t10:50\t\t10：:44')
print('Z158\t长春-北京\t12:48\t\t21:06\t\t08：:18')
print('Z62\t长春-北京\t21:58\t\t06:08\t\t08：:20')
a = input('请输入要购买的车次:')
b = input('请输入乘车人(用逗号隔开):') 
if a == 'T40':
    print('你已购买%s\t长春-北京\t00:12开\t请%s尽快换取纸质车票'%(a,b))
elif a == 'T298':   
    print('你已购买%s\t长春-北京\t00:06开\t请%s尽快换取纸质车票'%(a,b))
elif a == 'Z158':
    print('你已购买%s\t长春-北京\t12:48开\t请%s尽快换取纸质车票'%(a,b))
elif a == 'Z62':
    print('你已购买%s\t长春-北京\t21:58开\t请%s尽快换取纸质车票'%(a,b))
